IDEA StatiCa Open Model
OpenModelResult.LoadFromStream Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Creates the instance of Open Model Result from the stream
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static OpenModelResult LoadFromStream(
	Stream xmlFileStream
)
Public Shared Function LoadFromStream (
	xmlFileStream As Stream
) As OpenModelResult
public:
static OpenModelResult^ LoadFromStream(
	Stream^ xmlFileStream
)
Parameters
xmlFileStream
Type: System.IO.Stream
The input stream
Return Value
Type: OpenModelResult
The new instance of Open Model Result
See Also
Reference
OpenModelResult Class
IdeaRS.OpenModel.Result Namespace